Emacs Lisp

** Numbers
Ints and Floats

#+BEGIN_SRC elisp
  ;;22
  42.0
#+END_SRC

#+RESULTS:
: 42.0

*** Quotable

#+BEGIN_SRC elisp
  ;;(quote (1 2 3))
  ;;(list 1 2 3)
  ;;'(1 2 3)
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 |

*** Easy
#+BEGIN_SRC elisp
  (+ 1 2 3)
#+END_SRC

#+RESULTS:
: 4
*** Less Easy

#+BEGIN_SRC elisp
  (* 2 (- (/ 40 8) (% 4 6)))
#+END_SRC

#+RESULTS:
: 2

*** Building Lists - aka Cons the Magnificent
We're not always going to have the data we want, in the format we want it, so we need a way to combine atoms into lists programatically.

#+BEGIN_SRC elisp
  ;;(cons 3 4)
  ;;(cons (cons 3 4) '())
  ;;(cons '(2) (cons (cons 3 4) '()))
  (cons 1 (cons '(2) (cons (cons 3 4) '())))
#+END_SRC

#+RESULTS:
: (1 (2) (3 . 4))

**** The first thing to know about about working with lists
#+BEGIN_SRC elisp
  (car '(1 (2) (3 4)))
#+END_SRC

#+RESULTS:
: 1

**** The rest of it
#+BEGIN_SRC elisp
  (cdr '(1 (2) (3 4)))
#+END_SRC

#+RESULTS:
| 2 |   |
| 3 | 4 |

**** The beginning of the end
#+BEGIN_SRC elisp
  (cadr '(1 (2) (3 4)))
  ;;(car (cadr '(1 (2) (3 4))))
#+END_SRC

#+RESULTS:
| 2 |

*** let*

#+BEGIN_SRC elisp
  (let* ((a 40)
         (b (/ a 20)))
    (+ a b))  
#+END_SRC

#+RESULTS:
: 42

*** defun

#+BEGIN_SRC elisp
  (defun square (x) "return the square of a number" (* x x))
  ;;(square 4)
#+END_SRC

#+RESULTS:
: 16

*** lambda the Ultimate

#+BEGIN_SRC elisp
  ;;(fset 'square (lambda (x) (* x x)))
  (fsetq square (lambda (x) (* x x)))

  ;;What's a LISP2?
  ;;(setq square (lambda (x) (* x x))) 

  (square 4)
#+END_SRC

#+RESULTS:
: 16

* Recursion
No tail optimization. Does anyone know how to avoid blowing the stack?

#+BEGIN_SRC elisp
  (defun factorial (n)
    (if (< n 1)
      1
      (* n (factorial (- n 1)))))

  (factorial 5)
  ;;(factorial 19)
  ;;(factorial 20)
#+END_SRC

#+RESULTS:
: 120



* TODO Higher Order Functions
Get definition of a HOF from allonge org doc.

#+BEGIN_SRC elisp
 (mapcar (lambda (x) (* x x)) '(1 2 3 4 5))
#+END_SRC

#+RESULTS:
| 1 | 4 | 9 | 16 | 25 |

** TODO apropos
Lets you search for commands that contains a string (in the name or docstring?).

=C-h a=

#+BEGIN_SRC elisp
  (apropos-command "region")
#+END_SRC

#+RESULTS:
: Type C-x 1 to remove help window.  

** describe function

=C-h f=

#+BEGIN_SRC elisp
  (describe-function 'sort-lines)
#+END_SRC

#+RESULTS:
#+begin_example
sort-lines is an interactive autoloaded compiled Lisp function in
`sort.el'.

It is bound to C-M-f.

(sort-lines REVERSE BEG END)

Sort lines in region alphabetically; argument means descending order.
Called from a program, there are three arguments:
REVERSE (non-nil means reverse order), BEG and END (region to sort).
The variable `sort-fold-case' determines whether alphabetic case affects
the sort order.
#+end_example

